In [1]:
import pandas as pd 


data = {
    'tid' : [1,2,3,4,5,6,7,8,9,10],
    'Refund' : ['Yes','No','No','Yes','No','No','Yes','No','No','No'],
    'Martial_Status' : ['Single','Married','Single','Married','Divorced','Married','Divorced','Single','Married','Single'],
    'Taxable_Income' : ['125k','100k','70k','120k','95k','60k','220k','85k','75k','90k'],
    'Cheat': ['No','No','No','No','Yes','No','No','Yes','No','Yes']
}

df = pd.DataFrame(data)
print(df)

   tid Refund Martial_Status Taxable_Income Cheat
0    1    Yes         Single           125k    No
1    2     No        Married           100k    No
2    3     No         Single            70k    No
3    4    Yes        Married           120k    No
4    5     No       Divorced            95k   Yes
5    6     No        Married            60k    No
6    7    Yes       Divorced           220k    No
7    8     No         Single            85k   Yes
8    9     No        Married            75k    No
9   10     No         Single            90k   Yes

In [2]:
df.iloc[0]

tid                    1
Refund               Yes
Martial_Status    Single
Taxable_Income      125k
Cheat                 No
Name: 0, dtype: object

In [3]:
df.iloc[4]

tid                      5
Refund                  No
Martial_Status    Divorced
Taxable_Income         95k
Cheat                  Yes
Name: 4, dtype: object

In [4]:
df.iloc[7]

tid                    8
Refund                No
Martial_Status    Single
Taxable_Income       85k
Cheat                Yes
Name: 7, dtype: object

In [5]:
df.iloc[8]

tid                     9
Refund                 No
Martial_Status    Married
Taxable_Income        75k
Cheat                  No
Name: 8, dtype: object

In [7]:
df.iloc[3:8]

   tid Refund Martial_Status Taxable_Income Cheat
3    4    Yes        Married           120k    No
4    5     No       Divorced            95k   Yes
5    6     No        Married            60k    No
6    7    Yes       Divorced           220k    No
7    8     No         Single            85k   Yes

In [9]:
df.iloc[4:8,2:4]

  Martial_Status Taxable_Income
4       Divorced            95k
5        Married            60k
6       Divorced           220k
7         Single            85k

In [10]:
df.iloc[:,1:4]

  Refund Martial_Status Taxable_Income
0    Yes         Single           125k
1     No        Married           100k
2     No         Single            70k
3    Yes        Married           120k
4     No       Divorced            95k
5     No        Married            60k
6    Yes       Divorced           220k
7     No         Single            85k
8     No        Married            75k
9     No         Single            90k

In [11]:
df = pd.read_csv('Iris.csv')

In [12]:
df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [16]:
df.drop(4,axis = 0 , inplace = True)

In [18]:
df.drop(df.columns[3],axis=1,inplace=True)

In [19]:
df

      Id  SepalLengthCm  SepalWidthCm  PetalWidthCm         Species
0      1            5.1           3.5           0.2     Iris-setosa
1      2            4.9           3.0           0.2     Iris-setosa
2      3            4.7           3.2           0.2     Iris-setosa
3      4            4.6           3.1           0.2     Iris-setosa
5      6            5.4           3.9           0.4     Iris-setosa
..   ...            ...           ...           ...             ...
145  146            6.7           3.0           2.3  Iris-virginica
146  147            6.3           2.5           1.9  Iris-virginica
147  148            6.5           3.0           2.0  Iris-virginica
148  149            6.2           3.4           2.3  Iris-virginica
149  150            5.9           3.0           1.8  Iris-virginica

[149 rows x 5 columns]

In [20]:
df.shape

(149, 5)

In [24]:
df = pd.read_csv('employee_data.csv')

In [25]:
df.shape

(5, 10)

In [26]:
df.describe

<bound method NDFrame.describe of    Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020/03/15  Female   5000     4.5
1   2017/07/19    Male   7000     4.0
2   2013/06/01    Male   6000     3.8
3   2021/02/10  Female   4500     4.7
4   2010/11/25    Male   5000     3.5  >

In [27]:
df.head()

,Employee_ID,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating
0,101,Alice,HR,29,50000,4,2020/03/15,Female,5000,4.5
1,102,Bob,IT,34,70000,8,2017/07/19,Male,7000,4.0
2,103,Charlie,IT,41,65000,10,2013/06/01,Male,6000,3.8
3,104,Diana,Marketing,28,55000,3,2021/02/10,Female,4500,4.7
4,105,Edward,Sales,38,60000,12,2010/11/25,Male,5000,3.5

In [28]:
df.tail(3)

,Employee_ID,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating
2,103,Charlie,IT,41,65000,10,2013/06/01,Male,6000,3.8
3,104,Diana,Marketing,28,55000,3,2021/02/10,Female,4500,4.7
4,105,Edward,Sales,38,60000,12,2010/11/25,Male,5000,3.5

In [29]:
df['Salary'].mean()

np.float64(60000.0)

In [30]:
df['Bonus'].sum()

np.int64(27500)

In [33]:
df['Age'].min()

np.int64(28)

In [34]:
df['Rating'].max()

np.float64(4.7)

In [35]:
df_sorted = df.sort_values(by='Salary',ascending=False)

In [37]:
df_sorted

,Employee_ID,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating
1,102,Bob,IT,34,70000,8,2017/07/19,Male,7000,4.0
2,103,Charlie,IT,41,65000,10,2013/06/01,Male,6000,3.8
4,105,Edward,Sales,38,60000,12,2010/11/25,Male,5000,3.5
3,104,Diana,Marketing,28,55000,3,2021/02/10,Female,4500,4.7
0,101,Alice,HR,29,50000,4,2020/03/15,Female,5000,4.5

In [40]:
def categorize_performance(rating):
    if rating>=4.5:
        return "Excellent"
    elif 4.0<=rating<4.5:
        return 'Good'
    else:
        return 'Average'

df['Performance_Category']= df['Rating'].apply(categorize_performance)

In [41]:
df

,Employee_ID,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating,Performance_Category
0,101,Alice,HR,29,50000,4,2020/03/15,Female,5000,4.5,Excellent
1,102,Bob,IT,34,70000,8,2017/07/19,Male,7000,4.0,Good
2,103,Charlie,IT,41,65000,10,2013/06/01,Male,6000,3.8,Average
3,104,Diana,Marketing,28,55000,3,2021/02/10,Female,4500,4.7,Excellent
4,105,Edward,Sales,38,60000,12,2010/11/25,Male,5000,3.5,Average